With Terraform provider 1.8.0, I don't see a crash, but an API error after 2 minutes:

```An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pagerduty_ruleset.pagerduty_support will be created
  + resource "pagerduty_ruleset" "pagerduty_support" {
      + id           = (known after apply)
      + name         = "PagerDuty Support"
      + routing_keys = (known after apply)
      + type         = (known after apply)

      + team {
          + id = "<REDACTED>"
        }
    }

  # pagerduty_ruleset_rule.pagerduty_support_catch_all will be created
  + resource "pagerduty_ruleset_rule" "pagerduty_support_catch_all" {
      + id      = (known after apply)
      + ruleset = (known after apply)

      + actions {

          + route {
              + value = "<REDACTED>"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pagerduty_ruleset.pagerduty_support: Creating...
pagerduty_ruleset.pagerduty_support: Creation complete after 1s [id=<REDACTED>]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Creating...
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [10s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [20s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [30s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [40s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [50s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [1m0s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [1m10s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [1m20s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [1m30s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [1m40s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [1m50s elapsed]
pagerduty_ruleset_rule.pagerduty_support_catch_all: Still creating... [2m0s elapsed]

Error: POST API call to https://api.pagerduty.com/rulesets/<REDACTED>/rules failed 400 Bad Request. Code: 0, Errors: map[conditions:[can't be blank]], Message: Invalid payload

  on pagerduty_support.tf line 10, in resource "pagerduty_ruleset_rule" "pagerduty_support_catch_all":
  10: resource "pagerduty_ruleset_rule" "pagerduty_support_catch_all" {
```

Suggested `terraform import` workaround works well though, even if it's absolutely not ideal.